Revit 2027 API
DimensionSegmentArray.Insert Method
Insert the specified item into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	DimensionSegment item,
	int index
)
Public Overridable Sub Insert (
	item As DimensionSegment,
	index As Integer
)
public:
virtual void Insert(
	DimensionSegment^ item,
	int index
)
abstract Insert :
        item : DimensionSegment *
        index : int -> unit
override Insert :
        item : DimensionSegment *
        index : int -> unit
Parameters
item DimensionSegment
The item to be inserted into the array.
index Int32
The item will be inserted before this index.
Return Value
Returns whether the item was inserted into the array.
See Also
Reference
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace